In [198]:
import pandas as pd

In [199]:
df1 = pd.DataFrame({"A" : [1,2,3], "B" : [2,3,4]})

In [200]:
df2 = pd.DataFrame([[1,2], [2,3], [3,4]], columns=['A','B'])

In [201]:
df2

   A  B
0  1  2
1  2  3
2  3  4

In [202]:
df1

   A  B
0  1  2
1  2  3
2  3  4

In [203]:
df1.columns = ['Apple', "Samsung"]

In [204]:
df1.index = ['1분기', '2분기', '3분기']

In [205]:
df1

     Apple  Samsung
1분기      1        2
2분기      2        3
3분기      3        4

In [206]:
"Job's Iphone"

"Job's Iphone"

In [207]:
'Job's Iphone'

SyntaxError: invalid syntax (<ipython-input-207-66bb535c8589>, line 1)

In [208]:
'Job\'s Iphone'

"Job's Iphone"

In [209]:
[str(x) + "월" for x in range(1,13)]

['1월', '2월', '3월', '4월', '5월', '6월', '7월', '8월', '9월', '10월', '11월', '12월']

In [210]:
for x in range(1):
    print (type(x))

<class 'int'>

In [211]:
df1.index.name = "분기별"

In [212]:
df1

     Apple  Samsung
분기별
1분기      1        2
2분기      2        3
3분기      3        4

In [213]:
df1.columns = ['Apple', 'Benz']

In [214]:
df1.rename(columns={"Benz" : "KIA", "Apple" : "Google", "hmm" : "emart", 'sex' : '성별', 'gender' : '성별'})

     Google  KIA
분기별
1분기       1    2
2분기       2    3
3분기       3    4

#### 전사 사전 -> 성별 -> gender

In [215]:
kbo = pd.read_csv("./kbo.csv")

In [216]:
kbo.columns

Index(['선수명', '등번호', '생년월일', '포지션', '신장/체중', '경력', '입단 계약금', '연봉', '지명순위',
       '입단년도'],
      dtype='object')

In [217]:
kbo[['등번호', '생년월일', '포지션']]

      등번호           생년월일        포지션
0    21.0  1992년 12월 18일   투수(우투우타)
1    49.0  1993년 10월 19일  내야수(우투우타)
2    78.0  2001년 07월 26일   투수(우투좌타)
3    59.0  1997년 02월 17일   투수(좌투좌타)
4    65.0  1997년 04월 05일  외야수(우투우타)
..    ...            ...        ...
852  16.0  1994년 02월 25일  내야수(우투좌타)
853  59.0  2001년 03월 17일   투수(우투우타)
854  26.0  1999년 02월 12일   포수(우투우타)
855  60.0  1995년 12월 26일   투수(좌투좌타)
856   NaN  1992년 01월 10일  내야수(우투우타)

[857 rows x 3 columns]

In [218]:
kbo[['등번호']]

      등번호
0    21.0
1    49.0
2    78.0
3    59.0
4    65.0
..    ...
852  16.0
853  59.0
854  26.0
855  60.0
856   NaN

[857 rows x 1 columns]

In [219]:
kbo.등번호

0      21.0
1      49.0
2      78.0
3      59.0
4      65.0
       ...
852    16.0
853    59.0
854    26.0
855    60.0
856     NaN
Name: 등번호, Length: 857, dtype: float64

In [220]:
kbo.columns

Index(['선수명', '등번호', '생년월일', '포지션', '신장/체중', '경력', '입단 계약금', '연봉', '지명순위',
       '입단년도'],
      dtype='object')

In [221]:
kbo = kbo[['선수명',  '생년월일', '포지션','등번호', '신장/체중', '경력', '입단 계약금', '연봉', '지명순위',
       '입단년도']].head(1)

In [222]:
kbo.head(1)

,선수명,생년월일,포지션,등번호,신장/체중,경력,입단 계약금,연봉,지명순위,입단년도
0,강동연,1992년 12월 18일,투수(우투우타),21.0,195cm/94kg,진북초-덕수중-유신고-두산-상무-두산,NaN,4400만원,11 두산 육성선수,12두산

## 행 삭제

In [223]:
df1.drop(['1분기'], inplace=True)

In [224]:
df1

     Apple  Benz
분기별
2분기      2     3
3분기      3     4

In [225]:
df1.drop(['Apple'], axis=1)

     Benz
분기별
2분기     3
3분기     4

In [226]:
df3 = df2

In [227]:
df2

   A  B
0  1  2
1  2  3
2  3  4

In [228]:
df3

   A  B
0  1  2
1  2  3
2  3  4

In [229]:
df3.iloc[0,0] = 100

In [230]:
df3

     A  B
0  100  2
1    2  3
2    3  4

In [231]:
df4 = df2.copy()

In [232]:
df4.iloc[0,0] = 1000

In [233]:
df2

     A  B
0  100  2
1    2  3
2    3  4

In [234]:
투수 = kbo[kbo['포지션'] == '투수(우투우타)'].copy()

In [235]:
투수['키'] = 투수['신장/체중'].apply(lambda x : x.split("/")[0])

In [236]:
kbo

,선수명,생년월일,포지션,등번호,신장/체중,경력,입단 계약금,연봉,지명순위,입단년도
0,강동연,1992년 12월 18일,투수(우투우타),21.0,195cm/94kg,진북초-덕수중-유신고-두산-상무-두산,NaN,4400만원,11 두산 육성선수,12두산

In [237]:
df4

      A  B
0  1000  2
1     2  3
2     3  4

In [238]:
df4.loc[3, ['A', 'B']] = [5,6]

In [239]:
df4.loc[100, ['A', 'B']] = [5,6]

## 인덱스 초기화

In [240]:
df4.reset_index(drop=True, inplace=True)

In [241]:
df4

        A    B
0  1000.0  2.0
1     2.0  3.0
2     3.0  4.0
3     5.0  6.0
4     5.0  6.0

## 인덱스 설정 ( 컬럼 -> 인덱스)

In [242]:
kbo.set_index("선수명", inplace=True)

In [243]:
kbo

,생년월일,포지션,등번호,신장/체중,경력,입단 계약금,연봉,지명순위,입단년도
선수명,,,,,,,,,
강동연,1992년 12월 18일,투수(우투우타),21.0,195cm/94kg,진북초-덕수중-유신고-두산-상무-두산,NaN,4400만원,11 두산 육성선수,12두산

### new data

In [244]:
import requests

In [245]:
url = "https://finance.naver.com/item/sise_day.nhn?code={}&page={}"

In [246]:
code_list = ['035720', '005930']

In [247]:
head = {"user-agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/93.0.4577.63 Safari/537.36 Edg/93.0.961.38"}

In [248]:
r = requests.get("https://finance.naver.com/item/sise_day.nhn?code=005930&page=10", headers=head)

In [249]:
삼전 = pd.read_html(r.text)[0].dropna().iloc[::-1]

In [250]:
삼전.head(2)

            날짜       종가     전일비       시가       고가       저가         거래량
13  2021.04.20  83900.0   600.0  83300.0  84000.0  83100.0  15521965.0
12  2021.04.21  82600.0  1300.0  83300.0  83500.0  82500.0  21636079.0

In [251]:
삼전['전날'] = 삼전.종가.shift(1)

In [252]:
삼전['차이'] =삼전['종가'] - 삼전['전날']

In [253]:
삼전['상하락'] = 삼전.차이.apply(lambda x : True if x > 0 else False)

In [254]:
삼전2  = 삼전.copy()

In [255]:
삼전2.dropna(inplace=True)

In [256]:
삼전2['상하락'] = 삼전2[['종가', '전날']].apply(lambda x : True if x[0] - x[1] > 0 else False, axis=1)

In [257]:
삼전2

,날짜,종가,전일비,시가,고가,저가,거래량,전날,차이,상하락
12,2021.04.21,82600.0,1300.0,83300.0,83500.0,82500.0,21636079.0,83900.0,-1300.0,False
11,2021.04.22,82400.0,200.0,82900.0,83000.0,82400.0,13934746.0,82600.0,-200.0,False
10,2021.04.23,82800.0,400.0,81900.0,82900.0,81600.0,17805080.0,82400.0,400.0,True
9,2021.04.26,83500.0,700.0,82900.0,83500.0,82600.0,15489938.0,82800.0,700.0,True
5,2021.04.27,82900.0,600.0,83200.0,83300.0,82500.0,12941533.0,83500.0,-600.0,False
4,2021.04.28,82100.0,800.0,83200.0,83200.0,82100.0,15596759.0,82900.0,-800.0,False
3,2021.04.29,81700.0,400.0,82400.0,82500.0,81500.0,20000973.0,82100.0,-400.0,False
2,2021.04.30,81500.0,200.0,81900.0,82100.0,81500.0,18673197.0,81700.0,-200.0,False
1,2021.05.03,81700.0,200.0,81000.0,82400.0,81000.0,15710336.0,81500.0,200.0,True

In [258]:
url = "https://finance.naver.com/item/sise_day.nhn?code={}&page={}"
code_list = ['035720', '005930']

In [259]:
%%time
카카오 = []
for x in range(1, 20):
    r = requests.get(url.format('035720', x), headers=head)
    tmp = pd.read_html(r.text)[0].dropna()
    tmp['code'] = '035720'
    카카오.append(tmp)

Wall time: 1.02 s

In [260]:
1.29 * 936

1207.44

In [261]:
len(카카오)

19

In [262]:
cacao = pd.concat(카카오)

In [263]:
cacao = cacao.iloc[::-1].copy()

In [264]:
cacao.reset_index(drop=True, inplace=True)

In [265]:
cacao['MA15'] = cacao['종가'].rolling(15).mean()

In [266]:
cacao.dropna(inplace=True)

In [267]:
cacao.iloc[::-1]

,날짜,종가,전일비,시가,고가,저가,거래량,code,MA15
189,2021.09.09,128500.0,10000.0,134000.0,134500.0,128000.0,14249597.0,035720,149366.666667
188,2021.09.08,138500.0,15500.0,151500.0,151500.0,136500.0,16920382.0,035720,150566.666667
187,2021.09.07,154000.0,1500.0,155500.0,156000.0,153500.0,1072249.0,035720,151033.333333
186,2021.09.06,155500.0,1000.0,156000.0,156500.0,152500.0,1883428.0,035720,150233.333333
185,2021.09.03,156500.0,1500.0,155500.0,157500.0,154500.0,1934669.0,035720,149600.000000
...,...,...,...,...,...,...,...,...,...
18,2021.01.05,393000.0,3000.0,393000.0,395500.0,387000.0,748559.0,035720,378000.000000
17,2021.01.04,396000.0,6500.0,392000.0,396500.0,385500.0,853740.0,035720,376500.000000
16,2020.12.30,389500.0,5000.0,384500.0,394000.0,383500.0,813142.0,035720,375100.000000
15,2020.12.29,384500.0,11500.0,381000.0,385500.0,378000.0,857404.0,035720,374100.000000
14,2020.12.28,373000.0,1000.0,374500.0,377000.0,369500.0,646464.0,035720,374133.333333

In [268]:
stock = pd.read_csv("./data_4013_20210909.csv", encoding='cp949')

In [269]:
stock.shape

(2579, 12)

In [270]:
stock

,표준코드,단축코드,한글 종목명,한글 종목약명,영문 종목명,상장일,시장구분,증권구분,소속부,주식종류,액면가,상장주식수
0,KR7098120009,098120,(주)마이크로컨텍솔루션,마이크로컨텍솔,"Micro Contact Solution Co.,Ltd.",2008/09/23,KOSDAQ,주권,벤처기업부,보통주,500,8312766
1,KR7131100000,131100,(주)스카이이앤엠,스카이이앤엠,"SKY E&M Co., Ltd.",2011/06/14,KOSDAQ,주권,투자주의환기종목(소속부없음),보통주,100,41281205
2,KR7009520008,009520,(주)포스코엠텍,포스코엠텍,"POSCO M-TECH CO.,LTD.",1997/11/10,KOSDAQ,주권,우량기업부,보통주,500,41642703
3,KR7095570008,095570,AJ네트웍스보통주,AJ네트웍스,"AJ Networks Co.,Ltd.",2015/08/21,KOSPI,주권,NaN,보통주,1000,46822295
4,KR7006840003,006840,AK홀딩스보통주,AK홀딩스,"AK Holdings, Inc.",1999/08/11,KOSPI,주권,NaN,보통주,5000,13247561
...,...,...,...,...,...,...,...,...,...,...,...,...
2574,KR7000542001,000547,흥국화재해상보험2우선주(신형),흥국화재2우B,HeungkukFire&MarineIns(2PB),1999/08/09,KOSPI,주권,NaN,신형우선주,5000,153600
2575,KR7000540005,000540,흥국화재해상보험보통주,흥국화재,HeungkukFire&MarineInsurance,1974/12/05,KOSPI,주권,NaN,보통주,5000,64242645
2576,KR7003280005,003280,흥아해운보통주,흥아해운,HeungaShipping,1976/06/29,KOSPI,주권,NaN,보통주,500,239125028
2577,KR7037440005,037440,희림종합건축사사무소,희림,Heerim Architects & Planners,2000/02/03,KOSDAQ,주권,중견기업부,보통주,500,13922475
2578,KR7238490007,238490,힘스,힘스,"HIMS CO., LTD.",2017/07/20,KOSDAQ,주권,우량기업부,보통주,500,11312236

In [271]:
url_krx = "http://data.krx.co.kr/comm/bldAttendant/getJsonData.cmd"

In [272]:
payload = {
    "bld": "dbms/MDC/STAT/standard/MDCSTAT01901",
    "mktId": "ALL",
    "share": "1",
    "csvxls_isNo": "false",
}

In [273]:
r = requests.post(url_krx, data=payload, headers=head)

In [274]:
r.json().keys()

dict_keys(['OutBlock_1', 'CURRENT_DATETIME'])

In [275]:
pd.DataFrame(r.json()['OutBlock_1'])['MKT_TP_NM'].unique()

array(['KOSDAQ', 'KOSPI', 'KONEX'], dtype=object)

### KOSPI 대상 
### 네이버 금융 페이지 기준 20
### DataFrame -> 종목명, 종목코드, MA30
##### MA 계산할때 날짜 정렬된 것을 확인하고 만들것 
### 결측치는 제거 
### 모든 DataFrame은 total_stock이라는 DataFrame 저장

In [276]:
936 * 200

187200

In [277]:
def get_stock(code_, name_, page_, MA):
    url = "https://finance.naver.com/item/sise_day.nhn?code={}&page={}"
    head = {"user-agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/93.0.4577.63 Safari/537.36 Edg/93.0.961.38"}
    
    stock = []
    for x in range(1, page_):
        r = requests.get(url.format(code_, x), headers=head)
        tmp = pd.read_html(r.text)[0].dropna()
        tmp['종목코드'] = code_
        tmp['종목명'] = name_
        stock.append(tmp)
        
    total = pd.concat(stock)
    total = total.iloc[::-1].copy()
    total['MA{}'.format(MA)] = total['종가'].rolling(MA).mean()
    total.dropna(inplace=True)
    return total.reset_index(drop=True)

In [278]:
rt = get_stock("005930", "삼성전자", 21, 20)

In [279]:
krx = pd.DataFrame(r.json()['OutBlock_1'])

In [280]:
krx.head(3)

,ISU_CD,ISU_SRT_CD,ISU_NM,ISU_ABBRV,ISU_ENG_NM,LIST_DD,MKT_TP_NM,SECUGRP_NM,SECT_TP_NM,KIND_STKCERT_TP_NM,PARVAL,LIST_SHRS
0,KR7098120009,098120,(주)마이크로컨텍솔루션,마이크로컨텍솔,"Micro Contact Solution Co.,Ltd.",2008/09/23,KOSDAQ,주권,벤처기업부,보통주,500,"8,312,766"
1,KR7131100000,131100,(주)스카이이앤엠,스카이이앤엠,"SKY E&M Co., Ltd.",2011/06/14,KOSDAQ,주권,투자주의환기종목(소속부없음),보통주,100,"41,281,205"
2,KR7009520008,009520,(주)포스코엠텍,포스코엠텍,"POSCO M-TECH CO.,LTD.",1997/11/10,KOSDAQ,주권,우량기업부,보통주,500,"41,642,703"

In [281]:
total = []
for idx, contents in krx[krx.MKT_TP_NM == 'KOSPI'].loc[:, ['ISU_SRT_CD', 'ISU_ABBRV']].iloc[:100, :].iterrows():
    code_, name_ = contents
    total.append(get_stock(code_, name_, 21, 30))

In [282]:
total = pd.concat(total)

In [283]:
total.종목명.unique().size

100

In [284]:
total

,날짜,종가,전일비,시가,고가,저가,거래량,종목코드,종목명,MA30
0,2021.01.06,4710.0,225.0,4945.0,4945.0,4700.0,660674.0,095570,AJ네트웍스,4583.500000
1,2021.01.07,4695.0,15.0,4710.0,4755.0,4615.0,202736.0,095570,AJ네트웍스,4585.000000
2,2021.01.08,4540.0,155.0,4650.0,4665.0,4520.0,390267.0,095570,AJ네트웍스,4581.666667
3,2021.01.11,4360.0,180.0,4535.0,4540.0,4270.0,441563.0,095570,AJ네트웍스,4573.666667
4,2021.01.12,4385.0,25.0,4310.0,4450.0,4270.0,183639.0,095570,AJ네트웍스,4567.666667
...,...,...,...,...,...,...,...,...,...,...
166,2021.09.03,4285.0,15.0,4315.0,4325.0,4285.0,7473.0,001515,SK증권우,4428.833333
167,2021.09.06,4280.0,5.0,4270.0,4280.0,4265.0,6244.0,001515,SK증권우,4417.500000
168,2021.09.07,4280.0,0.0,4295.0,4295.0,4255.0,7732.0,001515,SK증권우,4406.333333
169,2021.09.08,4265.0,15.0,4295.0,4295.0,4260.0,6474.0,001515,SK증권우,4394.500000
170,2021.09.09,4235.0,30.0,4265.0,4265.0,4235.0,8311.0,001515,SK증권우,4382.666667

In [285]:
total.shape

(17013, 10)

In [286]:
total.to_csv("./주식데이터.csv", index=False, encoding='euc-kr')

## 월요일 주식 데이터 추출

In [287]:
from datetime import date, datetime, timedelta

In [288]:
datetime.strptime("2021.01.06", "%Y.%m.%d").weekday()

2

In [289]:
total['날짜'] = total.날짜.apply(lambda x : datetime.strptime(x, "%Y.%m.%d"))

In [290]:
total[total['날짜'].apply(lambda x : x.weekday()==0)]

,날짜,종가,전일비,시가,고가,저가,거래량,종목코드,종목명,MA30
3,2021-01-11,4360.0,180.0,4535.0,4540.0,4270.0,441563.0,095570,AJ네트웍스,4573.666667
8,2021-01-18,4485.0,25.0,4525.0,4560.0,4430.0,77316.0,095570,AJ네트웍스,4572.000000
13,2021-01-25,4195.0,15.0,4210.0,4235.0,4165.0,180458.0,095570,AJ네트웍스,4542.666667
18,2021-02-01,4040.0,30.0,3975.0,4050.0,3950.0,113449.0,095570,AJ네트웍스,4456.500000
23,2021-02-08,3995.0,65.0,4070.0,4070.0,3975.0,80600.0,095570,AJ네트웍스,4370.833333
...,...,...,...,...,...,...,...,...,...,...
143,2021-08-02,4500.0,45.0,4540.0,4540.0,4500.0,12564.0,001515,SK증권우,4733.666667
148,2021-08-09,4520.0,55.0,4570.0,4570.0,4520.0,9742.0,001515,SK증권우,4664.666667
157,2021-08-23,4290.0,105.0,4420.0,4420.0,4210.0,26861.0,001515,SK증권우,4540.166667
162,2021-08-30,4275.0,25.0,4270.0,4275.0,4250.0,6959.0,001515,SK증권우,4465.833333
167,2021-09-06,4280.0,5.0,4270.0,4280.0,4265.0,6244.0,001515,SK증권우,4417.500000

In [291]:
total2 = pd.read_csv("./주식데이터.csv", encoding='euc-kr')

In [292]:
total2.head(2)

,날짜,종가,전일비,시가,고가,저가,거래량,종목코드,종목명,MA30
0,2021.01.06,4710.0,225.0,4945.0,4945.0,4700.0,660674.0,095570,AJ네트웍스,4583.5
1,2021.01.07,4695.0,15.0,4710.0,4755.0,4615.0,202736.0,095570,AJ네트웍스,4585.0

In [293]:
total2.날짜 = pd.to_datetime(total2.날짜, format="%Y.%m.%d")

In [295]:
total2.날짜

0       2021-01-06
1       2021-01-07
2       2021-01-08
3       2021-01-11
4       2021-01-12
           ...
17008   2021-09-03
17009   2021-09-06
17010   2021-09-07
17011   2021-09-08
17012   2021-09-09
Name: 날짜, Length: 17013, dtype: datetime64[ns]

## 100일안에 종목별 가장 금액( 높은 날짜 데이터 출력)

In [294]:
total2.groupby('종목명')['전일비'].count()

종목명
AJ네트웍스        171
AK홀딩스         171
BGF           171
BGF리테일        171
BNK금융지주       171
             ...
SK아이이테크놀로지    123
SK우           171
SK이노베이션       171
SK이노베이션우      171
SK증권우         171
Name: 전일비, Length: 100, dtype: int64

In [297]:
total100 = total2[total2.날짜 > (datetime.now() - timedelta(days=100))].copy()

In [298]:
total100

,날짜,종가,전일비,시가,고가,저가,거래량,종목코드,종목명,MA30
100,2021-06-02,5800.0,20.0,5840.0,5840.0,5750.0,39320.0,095570,AJ네트웍스,5712.000000
101,2021-06-03,5720.0,80.0,5800.0,5800.0,5650.0,78440.0,095570,AJ네트웍스,5734.666667
102,2021-06-04,5570.0,150.0,5720.0,5720.0,5420.0,198246.0,095570,AJ네트웍스,5753.000000
103,2021-06-07,5420.0,150.0,5650.0,5660.0,5370.0,167712.0,095570,AJ네트웍스,5763.666667
104,2021-06-08,5480.0,60.0,5430.0,5510.0,5350.0,94656.0,095570,AJ네트웍스,5777.000000
...,...,...,...,...,...,...,...,...,...,...
17008,2021-09-03,4285.0,15.0,4315.0,4325.0,4285.0,7473.0,001515,SK증권우,4428.833333
17009,2021-09-06,4280.0,5.0,4270.0,4280.0,4265.0,6244.0,001515,SK증권우,4417.500000
17010,2021-09-07,4280.0,0.0,4295.0,4295.0,4255.0,7732.0,001515,SK증권우,4406.333333
17011,2021-09-08,4265.0,15.0,4295.0,4295.0,4260.0,6474.0,001515,SK증권우,4394.500000
17012,2021-09-09,4235.0,30.0,4265.0,4265.0,4235.0,8311.0,001515,SK증권우,4382.666667

In [300]:
total_rt = total100.groupby("종목명", as_index=False)[['고가']].max()

In [305]:
total_rt

           종목명        고가
0       AJ네트웍스    7320.0
1        AK홀딩스   38050.0
2          BGF    7230.0
3       BGF리테일  193000.0
4      BNK금융지주    8220.0
..         ...       ...
95  SK아이이테크놀로지  249000.0
96         SK우  280000.0
97     SK이노베이션  302000.0
98    SK이노베이션우  195500.0
99       SK증권우    5400.0

[100 rows x 2 columns]

In [301]:
total_rt[total_rt.종목명 == "SK이노베이션"]

        종목명        고가
97  SK이노베이션  302000.0

In [302]:
total_rt.head(1)

      종목명      고가
0  AJ네트웍스  7320.0

In [303]:
total100.head(1)

,날짜,종가,전일비,시가,고가,저가,거래량,종목코드,종목명,MA30
100,2021-06-02,5800.0,20.0,5840.0,5840.0,5750.0,39320.0,095570,AJ네트웍스,5712.0

In [306]:
rt2 = pd.merge(total_rt, total100, left_on=['종목명', '고가'], right_on=['종목명', '고가'], how='left').loc[:, ['종목명', '고가', '날짜']]

In [307]:
rt2[rt2.종목명.duplicated()]

          종목명        고가         날짜
6         BYC  457500.0 2021-09-07
8        BYC우  194500.0 2021-06-07
23         DL   85100.0 2021-06-03
36       GS건설   46050.0 2021-09-07
45  JW중외제약2우B   80000.0 2021-06-28
99    SK네트웍스우  127500.0 2021-06-03

In [308]:
rt2.query(" 종목명 == 'GS건설'")

     종목명       고가         날짜
35  GS건설  46050.0 2021-06-02
36  GS건설  46050.0 2021-09-07

In [309]:
total100 = total2[total2.날짜 > (datetime.now() - timedelta(days=100))].copy()
total_rt2 = total100.groupby("종목명", as_index=False)[['저가']].min()
rt2_저가 = pd.merge(total_rt2, total100, left_on=['종목명', '저가'], right_on=['종목명', '저가'], how='left').loc[:, ['종목명', '저가', '날짜']]

In [310]:
rt2_저가.head(2)

      종목명       저가         날짜
0  AJ네트웍스   5310.0 2021-06-09
1   AK홀딩스  23500.0 2021-08-20

In [311]:
rt2.head(2)

      종목명       고가         날짜
0  AJ네트웍스   7320.0 2021-07-14
1   AK홀딩스  38050.0 2021-06-03

In [312]:
for x in range(20):
    print (x % 5)

0
1
2
3
4
0
1
2
3
4
0
1
2
3
4
0
1
2
3
4